namespace TheBulgarianBot.Business.Message.TypicalCommand
{
    using System.Collections.Generic;

    /// <summary>
    /// A static class containing the texts for the /typical command.
    /// </summary>
    public static class TypicalTexts
    {
        /// <summary>
        /// Initializes static members of the <see cref="TypicalTexts"/> class.
        /// </summary>
        static TypicalTexts()
        {
            TypicalTexts.TypicalTextsList = new List<TypicalText>
            {
                new TypicalText("КРУШКАТА В СТАЯТА МУ ИЗГОРИ", "СВИВА ТАЯ ОТ ХОЛА"),
                new TypicalText("ЩЕ ПРАВИ ERASMUS", "ОТИВА В СОФИЙСКИ"),
                new TypicalText("ГУБИШ ВРЕМЕ ДА МУ ПРАВИШ CMS", "- СТРАХ МЕ Е ДА ПИПАМ"),
                new TypicalText("ПУСНЕ ОБЯВА В MARKPLAATS.NL", "ДАВАМ 10 ЕВРО ЗА КРАДЕНО КОЛЕЛО"),
                new TypicalText("12 ГОДИНИ УЧИЛИЩЕ, УНИВЕРСИТЕТ ПОЧНА", "И ПАК ВСЕКИ ДЕН SORRY DO YOU HAVE A PEN"),
                new TypicalText("КАЦА В АЙНДХОВЕН", "БИЛЕТЪТ МУ ЗА ВЛАКА ПО-СКЪП ОТ САМОЛЕТНИЯ"),
                new TypicalText("ДОКАТО КАРА КОЛЕЛО КЪМ УНИВЕРСИТЕТА", "СМЯТА КОЛКО ЩЕ МУ ИЗЛЕЗЕ ДА СИ ДОКАРА КОРСАТА"),
                new TypicalText("ОТИДЕ В ХОЛАНДИЯ", "ПРАЩА ЗЕЛЕНИ \"СУВЕНИРИ\" ПО ПОЩАТА"),
                new TypicalText("ПОДСТРИГВАНЕ 10 ЕВРО", "КУПИ СИ МАШИНКА И СЕ ПОДСТРИГВА САМ"),
                new TypicalText("СПУКА СИ ГУМАТА НА КОЛЕЛОТО", "СЛАГА СИ ГУМАТА ОТ КОЛЕЛОТО НА СЪКВАРТИРАНТА"),
                new TypicalText("ХВЪРЛЯ БОКЛУЦИ ПО ПОДА", "\"ЧИСТАЧКИТЕ ЗА КВО СА?\""),
                new TypicalText("НЕ РАЗБИРА НИЩО ОТ УРОКА", "\"ТВА ЗА КВО ШЕ МИ ПОТРЯБВА В ЖИВОТА\""),
                new TypicalText("ГОСПОЖАТА РАЗДАВА ТЕСТОВЕ", "\"КОЛКО ТОЧКИ СА ЗА 3?\""),
                new TypicalText("РАЗДАВАТ ПРЕЗЕРВАТИВИ В УЧИЛИЩЕ", "НАПЪЛНИ ГИ С ВОДА"),
                new TypicalText("ИГРАЕ CS 1 В 1", "ГЛЕДА ТИ В МОНИТОРА"),
                new TypicalText("1 СЕМЕСТЪР УЧИ В СТОЛИЦАТА", "\"КАК СТЕ В ПРОВИНЦИЯТА?\""),
                new TypicalText("БИЕ ПО-МАЛКИЯ СИ БРАТ", "\"ДА СИ ЗНАЕ\""),
                new TypicalText("ЗАКЪСНЕЕ ЗА ВТОРА СМЯНА", "УСПАЛ СЕ"),
                new TypicalText("ОТИДЕ ДО ТОАЛЕТНАТА", "ИЗПЛЮЕ СЕ В ТЕЧНИЯ САПУН"),
                new TypicalText("ПО ЧЕСТО ОПРАВЯ КОЛАТА", "ОТКОЛКОТО ЖЕНАТА"),
                new TypicalText("ЦЯЛАТА ЗАЛА В ОГЛЕДАЛА", "СНИМА СЕ В ТОАЛЕТНАТА"),
                new TypicalText("ФИТНЕСА Е 98% ОСВЕТЛЕНИЕ", "И 2% SUN ФИЛТЪРА НА INSTAGRAM"),
                new TypicalText("ВИКАШ ГО ДА ТЕ ПАЗИ НА ЛЕЖАНКАТА", "ОСТАВИ ТЕ ДА СЕ ЗАТИСНЕШ"),
                new TypicalText("БЕЗ ЗОБ СИ МИКРОБ", "УДРЯЙ ДЕКА И БЕГАЙ НА КЛЕКА"),
                new TypicalText("ВЗИМАЙ СТРОМБА", "И СИ БОМБА"),
                new TypicalText("ОГРОМНИ МУСКУЛИ", "ПОТНИК НА 16 ГОДИШНА ТИЙНЕЙДЖЪРКА"),
                new TypicalText("ПИТАТ ГО ПРОТЕИН ПИЕШ ЛИ", "\"ХИМИЯ НЕ ПОЛЗВАМ\""),
                new TypicalText("ТРЕНИРА 2 ДЕНА", "БЕЗ ЗОБ ЯВНО НЕ СТАВА РАБОТАТА"),
                new TypicalText("ОБЯСНЯВА КОЛКО ЧИСТО ЯДЕ", "НАПУШИ СА И ОМЕТЕ 2 ТОРБИ ЧИПС"),
                new TypicalText("ПИТАТ ГО ЗОБИЛ ЛИ Е", "\"САМО СТРОМБА И МЕТАН ИНАЧЕ СЪМ ЧИСТ\""),
                new TypicalText("ИДЕ НА ФИТНЕС", "3 ПЪТИ В СЕДМИЦАТА ПРАВИ РЪЦЕ"),
                new TypicalText("30 МИНУТИ ГО НЯМА; ИДВА", "\"БРАТ АЗ ТУКА ПРАЙХ, ИМАМ ОЩЕ 2 СЕРИИ\""),
                new TypicalText("ИДЕ НА ФИТНЕС", "ИЗЯДЕ 3 ПИЦИ ПРЕДИ ТОВА"),
                new TypicalText("ИДЕ НА ФИТНЕС", "ЦЕЛИЯ РАЗБЕРЕ FACEBOOK ЗА ТОВА"),
                new TypicalText("ИДЕ НА ФИТНЕС", "\"БРАТ ВЕЧЕ ТРЯБВА НЕЩО ДА СЕ ПИЕ\""),
                new TypicalText("КУПИ ГО ЕЛИТЕН ОТБОР ОТ ЧУЖБИНА", "ПРАТИ ГО ПОД НАЕМ В 5ТА ДИВИЗИЯ"),
                new TypicalText("ИГРАЛ 3 МИНУТИ", "БАЩА МУ ВДИГНЕ КУПОН НА СЕЛО"),
                new TypicalText("ПАДНАТ С 3:0", "\"СЪДИЯТА Е ВИНОВЕН\""),
                new TypicalText("ПОКАЖАТ МУ ЖЪЛТ КАРТОН", "НАПСУВА СЪДИЯТА И ИЗЛЕЗЕ"),
                new TypicalText("ПОКАЖАТ МУ ЧЕРВЕН КАРТОН", "НОКАУТИРА СЪДИЯТА"),
                new TypicalText("ВИКА ТИ: \"ГОТОВ СЪМ СЛЕД 5 МИН\"", "ЧАКАШ ГО 1 ЧАС"),
                new TypicalText("ИДЕ НА ФИТНЕС", "\"БРАТ, АЗ 1 ДЮНЕР ЩЕ ХАПНА, ЗА МАСА\""),
                new TypicalText("ПОЛЗВА НЕТА НА СЪСЕДА", "ПСУВА ГО ЧЕ БИЛ СЛАБ"),
                new TypicalText("ПИШАТ МУ 2-КА", "\"ЕВРОФУТБОЛА ДА ИЗЛЕЗЕ ПЪК ДРУГОТО ГО ЗАЕБИ\""),
                new TypicalText("УЧИ ПРАВО", "ОСЪДЕН НА 3 ГОДИНИ"),
                new TypicalText("КАЖЕШ МУ ЧЕ ИМАШ СЕСТРА", "ПИТА НА КОЛКО ГОДИНИ Е"),
                new TypicalText("ОБЕЩАЕ ТИ ДА СТАНЕ В 7 СУТРИНТА", "СПИ ДО 12 НА ОБЯД"),
                new TypicalText("ЗАСИЛИЛ СЕ ДА ГЛАСУВА ЗА МАРЕШКИ", "СЕТИЛ СЕ, ЧЕ Е С ГАЗОВА УРЕДБА"),
                new TypicalText("ВЛИЗА ТЕЖКО В МАГАЗИНА", "ВЗЕМЕ СИ 3 ЦИГАРИ НА ДРЕБНО"),
                new TypicalText("КУПИЛ СИ ТЕЛЕВИЗОР ЗА 2 БОНА", "УВИЛ ДИСТАНЦИОННОТО В НАЙЛОНЧЕ"),
                new TypicalText("ВЗЕМЕ МОМИЧЕ ОТ ДАЛЕЧЕН КВАРТАЛ", "НАСТОЯВА ЗА СВИРКА, ГОРИВОТО Е СКЪПО"),
                new TypicalText("КАЧИ СЕ В ПЪЛЕН АСАНСЬОР", "ИЗПЪРДИ СЕ КАТО СЛИЗА"),
                new TypicalText("ОТИВА НА КИНО", "НОСИ СИ СЕМКИ ОТ ТЯХ"),
                new TypicalText("СПИРА НА БЕНЗИНОСТАНЦИЯ С S КЛАСА", "ВИКА: \"СИПИ ЗА 15ЛВ ГАЗ\""),
                new TypicalText("ОПЛАКВА СЕ ОТ РАБОТАТА", "ЦЯЛ ДЕН ПИЕ КАФЕ И ЛАФИ ПО ФЕЙСА"),
                new TypicalText("КАЧИ СЕ В ПЪЛЕН АСАНСЬОР", "ИЗПЪРДИ СЕ КАТО СЛИЗА"),
                new TypicalText("ПРАВИ КАРДИО 10 МИНУТИ", "\"ВЕЧЕ МОГА ДА ХАПНА ЕДИН КАПСАЛОН\""),
                new TypicalText("ПРЕПИШЕ НА ИЗПИТА, ВЗЕМЕ ГО", "ЛЕСЕН БИЛ"),
                new TypicalText("ОТИДЕ НА РАБОТА", "ЗАРЕЖЕ РАБОТАТА, ЧЕТЕ КНИГА"),
                new TypicalText("ИМА МАНДРА", "ИДЕ В ГАЛАКСИ И ИЗХАРЧИ ОБОРОТА"),
                new TypicalText("ИСКА ТИ СЪВЕТ, ЧЕ ОТИВА НА ИНТЕРВЮ", "ИСКАМ ОЛИОТО ДА КАПЕ ОТ ТЕБ"),
                new TypicalText("КАЖЕ ТИ НАЗДРАВЕ", "ИЗПИЕ БУТИЛКАТА"),
                new TypicalText("ИДЕ В ХОЛАНДИЯ ДА РАБОТИ", "ПО ЦЯЛ ДЕН ПИШЕ ГЛУПОСТИ И ХОДИ НА ФИТНЕС"),
                new TypicalText("КОГАТО ЧЕРВЕНАТА РЕКА ПРЕЛЕЕ", "ЩЕ ГАЗИМ В КАЛТА"),
                new TypicalText("УГОВОРИТЕ СЕ ДА ТЕ ВЗЕМЕ ДА ХОДИТЕ В ПЛАНЕТ", "ЗАБРАВЯ ДА ДОЙДЕ И ЧАКА ПРЕД МОРАДО"),
                new TypicalText("ИДЕ В ГАЛАКСИ ДА СИ СНИМА СТОРИ", "ДА ГО ВИДЯТ ЧЕ Е ГЪЗАР; ПРИБЕРЕ СЕ ДА СПИ"),
                new TypicalText("ДОЙДЕ НА ФИТНЕС 3 ПЪТИ", "\"БРАТ ТАЯ ФАНЕЛКА ПРЕДИ МИ БЕШЕ ПО МЕН\""),
                new TypicalText("ПИТАШ Я КАКВО ТИ ИМА", "КАЖЕ ТИ НИЩО И ТИ СТЪЖНИ ЖИВОТА"),
                new TypicalText("ХВАНЕШ СИ ПРИЯТЕЛКА, БАБА ТИ ТИ КАЖЕ", "С ТОЯ МАЛЪК ГЪЗ НЯМА ДА МОЖЕ ДА РОДИ"),
                new TypicalText("- \"ИСКАШ ЛИ НЕЩО ОТ МАГАЗИНА?\" -\"НЕ СЪМ ГЛАДНА\"", "ИЗЯДЕ КАКВОТО СИ КУПИШ"),
                new TypicalText("ПИТАШ Я ПЕРВЕРЗНА ЛИ СИ, КАЖЕ ТИ НЕ", "НАВЕДЕШ СЕ И ТЕ ХВАНЕ ЗА ГЪЗА"),
                new TypicalText(
                    "ПИТАШ Я: \"ПРЪЦКАШ ЛИ?\" -\"НЕ, ТИ ЛУД ЛИ СИ?\"",
                    "СЛЕД МАЛКО ПУСНЕ ПРЪДНЯ ПО-СИЛНА ОТ ТВОЯТА"),
                new TypicalText("УЧИ ЗА ПРОГРАМИСТ, СТАНЕ ХАКЕР", "УБИЯТ ГО"),
                new TypicalText("ТРЯБВА ДА УЧИ", "ОТ ПОЛОВИН ЧАС МИСЛИ МЕМЕТА"),
                new TypicalText("ПИТАШ ГО: \"КРАКА ПРАВИШ ЛИ, БРАТ?\"", "\"РЪКАТА ДА РАСТЕ! ДРУГОТО НЕ Е ВАЖНО\""),
                new TypicalText("ПИТАШ ГО: \"КРАКА ПРАВИШ ЛИ, БРАТ?\"", "В ДИСКОТЕКАТА НИКОЙ НЕ ТИ ГЛЕДА КРАКАТА"),
            };
        }

        /// <summary>
        /// A list containing the texts to be used for the /typical command.
        /// </summary>
        public static IReadOnlyList<TypicalText> TypicalTextsList { get; }
    }
}
